In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns 

%config Completer.use_jedi = False

In [3]:
df= pd.read_excel('input_data/BMI.xlsx')
df

       Country  Y1980  Y1981  Y1982  Y1983
0  Afghanistan  21.48  21.46  21.45  21.44
1      Albania  25.22  25.24  25.26  25.27
2      Algeria  22.26  22.35  22.44  22.52

In [5]:
# Melt df into new dataframe: df_melted
df_melted=pd.melt (df, id_vars=['Country'],var_name="year", value_name="bmi")
df_melted

        Country   year    bmi
0   Afghanistan  Y1980  21.48
1       Albania  Y1980  25.22
2       Algeria  Y1980  22.26
3   Afghanistan  Y1981  21.46
4       Albania  Y1981  25.24
5       Algeria  Y1981  22.35
6   Afghanistan  Y1982  21.45
7       Albania  Y1982  25.26
8       Algeria  Y1982  22.44
9   Afghanistan  Y1983  21.44
10      Albania  Y1983  25.27
11      Algeria  Y1983  22.52

In [7]:
df_melted.year = df_melted.year.map(lambda x: int(x[1:]))

In [8]:
df_melted

        Country  year    bmi
0   Afghanistan  1980  21.48
1       Albania  1980  25.22
2       Algeria  1980  22.26
3   Afghanistan  1981  21.46
4       Albania  1981  25.24
5       Algeria  1981  22.35
6   Afghanistan  1982  21.45
7       Albania  1982  25.26
8       Algeria  1982  22.44
9   Afghanistan  1983  21.44
10      Albania  1983  25.27
11      Algeria  1983  22.52

In [9]:
df_pivot = df_melted.pivot(index='Country',columns='year',values='bmi')
df_pivot

year          1980   1981   1982   1983
Country
Afghanistan  21.48  21.46  21.45  21.44
Albania      25.22  25.24  25.26  25.27
Algeria      22.26  22.35  22.44  22.52

### CÃ¢u 2

In [10]:
df= pd.read_excel('input_data/student.xlsx')
df

  Student  Physics  Chemistry  English  Math
0    John       78         79       56    95
1   Alice       58         72       91    81
2  Rachel       22         61       88    64
3     Tom       78         89       56    83

In [11]:
# Melt df into new dataframe: df_melted
df_melted=pd.melt (df, id_vars=['Student'],var_name="Subject", value_name="Marks")
df_melted

   Student    Subject  Marks
0     John    Physics     78
1    Alice    Physics     58
2   Rachel    Physics     22
3      Tom    Physics     78
4     John  Chemistry     79
5    Alice  Chemistry     72
6   Rachel  Chemistry     61
7      Tom  Chemistry     89
8     John    English     56
9    Alice    English     91
10  Rachel    English     88
11     Tom    English     56
12    John       Math     95
13   Alice       Math     81
14  Rachel       Math     64
15     Tom       Math     83

In [13]:
# Melt df into new dataframe: df_melted
df_melted_1 =pd.melt (df, id_vars=['Student'],
                      value_vars = ['Physics','Chemistry','English','Math'],
                      var_name="Subject", value_name="Marks")
df_melted_1

   Student    Subject  Marks
0     John    Physics     78
1    Alice    Physics     58
2   Rachel    Physics     22
3      Tom    Physics     78
4     John  Chemistry     79
5    Alice  Chemistry     72
6   Rachel  Chemistry     61
7      Tom  Chemistry     89
8     John    English     56
9    Alice    English     91
10  Rachel    English     88
11     Tom    English     56
12    John       Math     95
13   Alice       Math     81
14  Rachel       Math     64
15     Tom       Math     83

In [14]:
df_pivot = df_melted.pivot(index='Student',columns='Subject',values='Marks')
df_pivot

Subject  Chemistry  English  Math  Physics
Student
Alice           72       91    81       58
John            79       56    95       78
Rachel          61       88    64       22
Tom             89       56    83       78